---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.DesignOptionFailures.ElementsWillBeDeletedNoOption
source: html/f4604e09-c291-3308-3f0b-0d3dee630e3e.htm
---
# Autodesk.Revit.DB.BuiltInFailures.DesignOptionFailures.ElementsWillBeDeletedNoOption Property

Elements will be deleted

## Syntax (C#)
```csharp
public static FailureDefinitionId ElementsWillBeDeletedNoOption { get; }
```